
// Pointer_Learn1.c

#include <stdio.h>

// 포인터 연산자
// 포인터는 메모리를 저장하는 키워드로서 C언어가 하드웨어와 가까운 저급언어 취급을 받는 이유기도 하다.
// C언어는 고급언어도 아니고 저급언어도 아닌 미들언어에 가까운데 이유가 포인터에 존재때문
// 포인터를 통해 하드웨어에 대한 직접적인 접근이 가능하다.

/* 포인터 */
// 포인터 변수는 변수의 주소값을 저장하기 위한 변수이다.
// 해당 변수에 메모리 주소에 직접 접근하여 값을 변경할 수 있다.

//포인터 선언 방법
// 1. 데이터타입* 식별자
// 2. 데이터타입 * 식별자
// 3. 데이터타입 *식별자
int main(void)
{
	int originValue = 10;
	// 포인터 연산자(*)와 주소 연산자(&)는 셋트이다.
	// 포인터 변수인 ptr 선언
	int* ptr;

	// 포인터에는 변수의 주소 값이 들어가야 하는데 변수의 주소값은 엠퍼센트(&)로 표현할 수 있다.
	ptr = &originValue;

	printf("originValue의 값 : %d\n", originValue);
	printf("originValue의 주소 : %p\n", &originValue);

	printf("ptr의 값 : %p\n", ptr);
	printf("ptr의 주소 : %p\n", &ptr);
	printf("ptr이 가리키는 값 : %d\n", *ptr);

	// 포인터는 쓰레기 값이 변수처럼 들어가는데 초기화를 안해줄거면 항시 Null로 초기화를 해놓는 것이 좋다.
	int* ptr2 = NULL;		// 포인터는 초기화를 할 떄 NULL이 아니라 NULL은 결국 0이기 때문에 아니다.
									// nullptr이라는 포인터만에 null값으로 초기화해주어야한다. C언어에선 제공안해줘서 C++부터 해줌


	return 0;
}