
#include <stdio.h>

/* 길이 10의 배열 arr을 선언한 후// 포인터 변수 ptr만을 사용하여// 배열의 값을 2씩 증가시켜라
* 이 때 포인터 변수 ptr에 저장된 값은 변경시키면 안된다. 즉 ptr++같이 전위 또는 후위 증감연산을 하면
* ptr의 값이 변경되므로 ptr의 값 변경 없이 배열의 원소 값들을 전부 2만큼 씩 증가시켜라
* 
* 
* //실행결과
 * 배열 기본 값 : 1 2 3 4 5 6 7 8 9 10
배열 주소 값 : 0001, ptr의 값 : 0001
배열 기본 값 : 3 4 5 6 7 8 9 10 11 12
배열 주소 값 : 0001, ptr의 값 : 0001
*/

int main(void)
{
	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
	int* ptr = &arr;
	printf("배열 기본 값 : ");
	for (int i = 0; i < 10; ++i)
	{
		printf("%d ", arr[i]);
		//ptr[i]를 사용하면 안됨, 포인터의 인덱스는 사용하지 않고 주소연산을 사용한다.
	}
	printf("\n배열 주소 값 : %p, ptr의 값 : %p", arr, ptr);
	printf("\n배열 기본 값 : ");
	for (int i = 0; i < 10; ++i)
	{
		*(ptr + i) += 2;
		printf("%d ", arr[i]);
	}
	printf("\n배열 주소 값 : %p, ptr의 값 : %p", arr, ptr);
}